app/Controllers/Sekolah.php

    public function index()
    {
        $current = $this->request->getVar('page_sekolah')? $this->request->getVar('page_sekolah'):1;
        $cari= $this->request->getVar('cari');
        if($cari){
            $sekolah= $this->SekolahModel->findSekolah($cari);
        }else{
            $sekolah = $this->SekolahModel;
        }
        $data = [
            'title' => 'Laporan Data Siswa',
            'sekolah' => $this->SekolahModel->paginate(2, 'sekolah'),
---
SELECT *
FROM `sekolah`
 LIMIT 2
SELECT COUNT(*) AS `numrows`
FROM `sekolah`

        $nmfoto = $filefoto->getName();

        // simpan
        $this->SekolahModel->save([
            'nama'        => $this->request->getVar('nama'),
            'jurusan'    => $this->request->getVar('jurusan'),
            'alamat'     => $this->request->getVar('alamat'),
            'tahun_masuk' => $this->request->getVar('tahun_masuk'),
            'asal_sekolah' => $this->request->getVar('asal_sekolah'),
            'no_telepon' => $this->request->getVar('no_telepon'),
            'status' => $this->request->getVar('status'),
            'foto'       => $nmfoto
        ]);
---
INSERT INTO `sekolah` (`nama`, `jurusan`, `alamat`, `tahun_masuk`, `asal_sekolah`, `no_telepon`, `status`, `foto`) VALUES ('chyntia', 'ti', 'kebumen', '2017', 'sma', '087', 'jomblo', 'download__12_-removebg-preview.png')